ТОИР_демо/src/Documents/торо_СостоянияОбъектовРемонта/торо_СостоянияОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_СостоянияОбъектовРемонта</name>
  <basedOn>Document.торо_ВыявленныеДефекты</basedOn>
  <basedOn>Document.торо_АктОВыполненииЭтапаРабот</basedOn>
  <basedOn>Document.торо_АктОВыполненииРегламентногоМероприятия</basedOn>
  <registerRecords>InformationRegister.торо_ТекущееСостояниеОР</registerRecords>
  <registerRecords>AccumulationRegister.торо_КоличествоПусковОР</registerRecords>
  <registerRecords>AccumulationRegister.торо_ВремяПростояОборудования</registerRecords>
  <registerRecords>AccumulationRegister.торо_ВремяНахожденияВСостоянии</registerRecords>
  <registerRecords>AccumulationRegister.торо_ОстановленноеОборудование</registerRecords>
  <registerRecords>AccumulationRegister.торо_ОборудованиеНаИспытаниях</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.торо_ВидыОперацийОтклоненияВРаботеОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_УчетКонтролируемыхПоказателей</types>
      <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЭксплуатации</name>
    <type>
      <types>CatalogRef.торо_ВидыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзМобильного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыРемонта</name>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаПростоя</name>
      <type>
        <types>CatalogRef.торо_ПричиныПростояОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзменятьСостояниеПодчиненныхОР</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЭксплуатации</name>
      <type>
        <types>CatalogRef.торо_ВидыЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПуска</name>
      <type>
        <types>CatalogRef.торо_ВидыПусковОР</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЭксплуатацииНаПериод</name>
      <type>
        <types>CatalogRef.торо_ВидыЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПускаНаПериод</name>
      <type>
        <types>CatalogRef.торо_ВидыПусковОР</types>
      </type>
    </attributes>
    <attributes>
      <name>Иерархия</name>
      <comment>Предназначен для определения иерархии для структуры которой будет распространятся наработка.</comment>
      <type>
        <types>CatalogRef.торо_СтруктурыОР</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийОР</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ТОИР_демо/src/Enums/торо_ВидыОперацийОтклоненияВРаботеОборудования/торо_ВидыОперацийОтклоненияВРаботеОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВидыОперацийОтклоненияВРаботеОборудования</name>
  <enumValues>
    <name>ВидЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ВидЭксплуатацииНаПериод</name>
  </enumValues>
</mdclass:Enum>

ТОИР_демо/src/Documents/торо_СостоянияОбъектовРемонта/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// Ограничение ввода на основании
	торо_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, Новый Структура("ОграничитьВводНаОсновании, УстановитьСвойствоЭлементовФормыОтПрав",Истина, Истина));
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.Печать

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура СоздатьДокументНаПериод(Команда)
	
	ОткрытьФорму("Документ.торо_СостоянияОбъектовРемонта.ФормаОбъекта", Новый Структура("ВидОперации", ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатацииНаПериод")), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументНаДату(Команда)
	
	ОткрытьФорму("Документ.торо_СостоянияОбъектовРемонта.ФормаОбъекта", Новый Структура("ВидОперации", ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатации")), ЭтаФорма);
	
КонецПроцедуры

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

#КонецОбласти
